app/views/pokemons/show.html.erb

SELECT "moves".* FROM "moves" INNER JOIN "pokemon_moves" ON "moves"."id" = "pokemon_moves"."move_id" WHERE "pokemon_moves"."pokemon_id" = ?  [["pokemon_id", 3]]
---

<% @pokemon.moves.each do |move| %>