app/controllers/moves_controller.rb

SELECT "moves".* FROM "moves"
---
  def index
    @moves = Move.all

INSERT INTO "moves" ("name", "description", "type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @move = Move.new(move_params)

    respond_to do |format|
      if @move.save

SELECT  "moves".* FROM "moves" WHERE "moves"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_move
      @move = Move.find(params[:id])