app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT "types".* FROM "types" WHERE "types"."id" IN (5, 4)
SELECT COUNT(*) FROM "pokemons"
---
	def index
		@pokemons = Pokemon.paginate(page: params[:page], per_page: 1)
		.includes(:type)

INSERT INTO "pokemons" ("name", "number", "level", "health_points") VALUES (?, ?, ?, ?)  [["name", "Onix"], ["number", 86], ["level", 50], ["health_points", 80]]
---
	def create
		@pokemon = Pokemon.new pokemon_params
		if @pokemon.save

UPDATE "pokemons" SET "number" = ?, "level" = ?, "health_points" = ? WHERE "pokemons"."id" = ?  [["number", 126], ["level", 80], ["health_points", 160], ["id", 1]]
---
	def update
		if @pokemon.update pokemon_params

DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 8]]
---
	def destroy
		@pokemon.destroy

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
	def set_pokemon
		@pokemon = Pokemon.find params[:id]