app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @types = Type.all

INSERT INTO "types" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Feu"], ["color", "orange"], ["created_at", 2017-03-22 14:11:37 UTC], ["updated_at", 2017-03-22 14:11:37 UTC]]
---
  def create
    @type = Type.new(type_params)

    respond_to do |format|
      if @type.save

UPDATE "types" SET "color" = ?, "updated_at" = ? WHERE "types"."id" = ?  [["color", "blue"], ["updated_at", 2017-04-11 13:26:29 UTC], ["id", 5]]
---
  def update
    respond_to do |format|
      if @type.update(type_params)

DELETE FROM "types" WHERE "types"."id" = ?  [["id", 1]]
---
  def destroy
    @type.destroy

SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_type
      @type = Type.find(params[:id])